ДомПласт_локальная_база/src/InformationRegisters/УчетнаяПолитикаНалоговыйУчет/УчетнаяПолитикаНалоговыйУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитикаНалоговыйУчет</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>НДСНалоговыйПериод</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <resources>
    <name>НДСМетодОтнесенияВЗачет</name>
    <type>
      <types>EnumRef.МетодыОтнесенияНДСВЗачет</types>
    </type>
  </resources>
  <resources>
    <name>ОрганизацияЯвляетсяПлательщикомНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОрганизацияЯвляетсяПлательщикомКПН</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОрганизацияЯвляетсяПлательщикомАкциза</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОрганизацияЯвляетсяПлательщикомСН</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УпрощенныйУчетИПНиОПВ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтражениеПоПериодуРегистрации</name>
    <comment>Используется для расчета ИПН, ОПВ, СН и СО</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗасчитыватьВВыплаченныеДоходыУдержанияПоИЛ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрименятьОграничениеНаМинимальнуюБазуСоциальногоНалога</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокСписанияЗадолженностиПоЗарплате</name>
    <type>
      <types>EnumRef.ПорядокСписанияЗадолженностиПоЗарплате</types>
    </type>
  </resources>
  <resources>
    <name>РаспределятьНалогиПоСтруктурнымЕдиницам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РаспределятьНалогиПоПодразделениямОрганизаций</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОрганизацияЯвляетсяВкладчикомОППВ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПрименятьОграничениеНаМинимальныйОбъектОСМС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЕжемесячныйРасчетВзносовИОтчисленийЗаИП</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокРасчетаДоходаОПВ</name>
    <type>
      <types>EnumRef.ПорядокРасчетаДоходовЗаИП</types>
    </type>
  </resources>
  <resources>
    <name>РазмерДоходаОПВ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПорядокРасчетаДоходаСО</name>
    <type>
      <types>EnumRef.ПорядокРасчетаДоходовЗаИП</types>
    </type>
  </resources>
  <resources>
    <name>РазмерДоходаСО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПредоставлятьВычетВМесяцеОтсутствияДохода</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособОтраженияОПВИП</name>
    <type>
      <types>CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</types>
    </type>
  </resources>
  <resources>
    <name>СпособОтраженияСОИП</name>
    <type>
      <types>CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</types>
    </type>
  </resources>
  <resources>
    <name>РежимНалогообложения</name>
    <type>
      <types>EnumRef.РежимНалогообложения</types>
    </type>
  </resources>
  <resources>
    <name>СтавкаВОСМСДляИП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособОтраженияВОСМСИП</name>
    <type>
      <types>CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</types>
    </type>
  </resources>
  <resources>
    <name>РазмерДоходаВОСМС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПорядокРасчетаДоходаВОСМС</name>
    <type>
      <types>EnumRef.ПорядокРасчетаДоходовЗаИП</types>
    </type>
  </resources>
  <resources>
    <name>НеПрименятьКорректировкуПрочихНалоговВзносовОтчислений</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПрименятьВычетВОСМСДляФизическихЛицИГПХ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтавкаОПВдляИП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтавкаСОДляИП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрименятьВычетОПВиВОСМСДляГПХ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ДомПласт_локальная_база/src/Enums/РежимНалогообложения/РежимНалогообложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимНалогообложения</name>
  <enumValues>
    <name>Патент</name>
  </enumValues>
  <enumValues>
    <name>УпрощеннаяДекларация</name>
  </enumValues>
  <enumValues>
    <name>ФиксированныйВычет</name>
  </enumValues>
  <enumValues>
    <name>Общеустановленный</name>
  </enumValues>
</mdclass:Enum>

ДомПласт_локальная_база/src/InformationRegisters/УчетнаяПолитикаНалоговыйУчет/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция возвращает список всех используемых в информационной базе систем налогообложения
//
// Параметры:
//  ВидОрганизации         - Строка - имя вида организации
//  СистемаНалогообложения - Строка - имя системы налогообложения
//
// Возвращаемое значение:
//  Структура - где ключ - имя ресурса регистра УчетнаяПолитикаНалоговыйУчет
//
Функция СтруктураУчетнойПолитики(ВидОрганизации, СистемаНалогообложения) Экспорт
	
	СтруктураУчетнойПолитики = Новый Структура;
	
	Если СистемаНалогообложения = "Патент" Тогда
		
		СтруктураУчетнойПолитики.Вставить("ОрганизацияЯвляетсяПлательщикомСН",  Ложь);
		СтруктураУчетнойПолитики.Вставить("ОрганизацияЯвляетсяПлательщикомКПН", Истина);
		СтруктураУчетнойПолитики.Вставить("РежимНалогообложения",               Перечисления.РежимНалогообложения.Патент);
		
	ИначеЕсли СистемаНалогообложения = "УпрощеннаяДекларация" Тогда
		
		СтруктураУчетнойПолитики.Вставить("ОрганизацияЯвляетсяПлательщикомСН",  Ложь);
		СтруктураУчетнойПолитики.Вставить("ОрганизацияЯвляетсяПлательщикомКПН", Ложь);
		СтруктураУчетнойПолитики.Вставить("РежимНалогообложения",               Перечисления.РежимНалогообложения.УпрощеннаяДекларация);
		
	ИначеЕсли СистемаНалогообложения = "ФиксированныйВычет" Тогда
		
		СтруктураУчетнойПолитики.Вставить("ОрганизацияЯвляетсяПлательщикомСН",  Ложь);
		СтруктураУчетнойПолитики.Вставить("ОрганизацияЯвляетсяПлательщикомКПН", Истина);
		СтруктураУчетнойПолитики.Вставить("РежимНалогообложения",               Перечисления.РежимНалогообложения.ФиксированныйВычет);
		
	Иначе
		
		СтруктураУчетнойПолитики.Вставить("ОрганизацияЯвляетсяПлательщикомСН",  Истина);
		СтруктураУчетнойПолитики.Вставить("ОрганизацияЯвляетсяПлательщикомКПН", Истина);
		СтруктураУчетнойПолитики.Вставить("РежимНалогообложения",               Перечисления.РежимНалогообложения.Общеустановленный);
		
	КонецЕсли;
	
	Возврат СтруктураУчетнойПолитики;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти
	
#КонецЕсли
